#### 1) Store marks of 5 subjects
	here use marks as actual data and subject names as indexes.
    accept both marks and subjects from the user.

In [6]:
import pandas as pd
dct = {'Makrs':[97,94,89,96,76]}
subjects = ['Maths','Science','English','Geography','History']
df = pd.DataFrame(dct,index=subjects)
df

           Makrs
Maths         97
Science       94
English       89
Geography     96
History       76

#### 2) Create dictionary to store player name and runs scored of at least 5 players. Display it. Now convert this dictionary â€Œinto Series object and print it.

In [18]:
dct = {'Players':['Rohit','Virat','Sky','Pant','Hardik'],'Runs':[257,151,199,171,144]}
ser = pd.Series(dct)
print(ser)

Players    [Rohit, Virat, Sky, Pant, Hardik]
Runs               [257, 151, 199, 171, 144]
dtype: object

#### 3) accept 10 values and store them in the Series. Now perform following operations:
    a) display the entire Series
    b) extract 3rd element
    c) extract elements from 4 to 7
    d) extract elements from fourth last till the last element
    e) extract first 3 elements
    f) extract elements from the 5th position

In [31]:
ser = pd.Series([int(x) for x in input('Enter 10 numbers').split()])
print(ser.values)

Enter 10 numbers 1 2 3 4 5 6 7 8 9 10

[ 1  2  3  4  5  6  7  8  9 10]

In [33]:
ser[2]

3

In [35]:
print(ser[3:7].values)

[4 5 6 7]

In [37]:
print(ser[-4:].values)

[ 7  8  9 10]

In [39]:
print(ser[:3].values)

[1 2 3]

In [41]:
print(ser[:5].values)

[1 2 3 4 5]

#### 4) Accept 5 values in a Series and perform the following operations:
	a) display their sum
	b) add the value accepted from the user
	c) subtract the value accepted from the user
	d) multiply the value accepted from the user
	e) divide the value accepted from the user

In [54]:
ser = pd.Series([int(x) for x in input('Enter 5 numbers').split()])
print('Sum:',ser.sum())

Enter 5 numbers 10 20 30 40 50

Sum: 150

In [56]:
n = int(input('Enter a number'))
print('Add:',(ser+n).values)
print('Sub:',(ser-n).values)
print('Multiply:',(ser*n).values)
print('Divide:',(ser/n).values)

Enter a number 2

Add: [12 22 32 42 52]
Sub: [ 8 18 28 38 48]
Multiply: [ 20  40  60  80 100]
Divide: [ 5. 10. 15. 20. 25.]

#### 5) accept 5 names,designations and salaries and display them with DataFrame.

In [65]:
dct = {'Name':[],'Designations':[],'Salaries':[]}
for i in range(5):
    name,desig,salary = input('Enter names,designations and salaries ').split()
    dct['Name'].append(name)
    dct['Designations'].append(desig)
    dct['Salaries'].append(salary)

df = pd.DataFrame(dct)
df

Enter names,designations and salaries  Michael Manager 5000
Enter names,designations and salaries  Jim Sales 4000
Enter names,designations and salaries  Dwight Assistant_to_the_Regional_Manager 3500
Enter names,designations and salaries  Pam Receptionist 2500
Enter names,designations and salaries  Kevin Accountant 3000

      Name                       Designations Salaries
0  Michael                            Manager     5000
1      Jim                              Sales     4000
2   Dwight  Assistant_to_the_Regional_Manager     3500
3      Pam                       Receptionist     2500
4    Kevin                         Accountant     3000

#### 6) create a csv file (with whatever columns and rows you want) manually and then read using pandas.

In [5]:
import pandas as pd
df = pd.read_csv('myexcel.csv')
df

   EmpID     Name  DeptID  Salary
0      1    Alice       1    5000
1      2      Bob       1    7000
2      3  Charlie       1    6000
3      4    David       2    4000
4      5      Eve       2    3000
5      6    Frank       3    4500
6      7    Grace       3    4700
7      8    Heidi       4    5500
8      9     Ivan       4    5200

#### 7) create "Vita.xlsx" using pandas. In this Excel file you have to create 2 sheets "DBDA", and "DAC". 
in each sheet you have to write name,address and age of all the team leaders.
make sure Excel file gets created successfully.

In [63]:
strr = input().lower()
lst = list(strr)
dct = {i:0 for i in range(1,27)}
for i in lst:
    ascii = ord(i) - 96
    dct[ascii] = 1

for i in range(1,27):
    if dct[i] == 0:
        print('Not Pangram')
        break
else:
    print('Pangram')

 the quick brown fox jumps over the lazy dog.

Pangram

In [45]:
def is_pangram(sentence):
    alphabet=set('abcdefghijklmnopqrstuvwxyz')
    sen_set=set(sentence.lower())
    return alphabet.issubset(sen_set)
sentence=input("enter sentence:")
if is_pangram(sentence):
    print("is pangram")
else:
    print("not pamgram")

enter sentence: A, B, C, D, E, F, G, H, I, J, K, L, M, N, O, P, Q, R, S, T, U, V, W, X, Y, Z

is pangram

In [47]:
alpha = 'abcdefghijklmnopqrstuvwxyz'
strr=input("").lower()
for c in alpha:
    if c not in strr:
        print('Not Pangram')
        break
else:
    print("Pangram")

 the quick brown fox jumps over the lazy dog

Pangram

In [57]:
set1 = set([chr(x) for x in range(97,123)])
set2 = set([i for i in input("").lower() if i.isalpha()])
print("Pangram") if (set1==set2) else print('Not')

 the quick brown fox jumps over the lazy dog

Pangram